In [2]:
import requests
import pandas as pd

In [5]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(PPP)_per_capita'

r = requests.get(url)
html = r.text

In [12]:
url = 'http://data.krx.co.kr/comm/bldAttendant/getJsonData.cmd'
data = {
        'bld': 'dbms/MDC/STAT/standard/MDCSTAT01901',
        'mktId': 'STK',
        'share': '1',
        'csvxls_isNo': 'false'
}
r = requests.post(url, data = data)
pd.DataFrame(r.json()['OutBlock_1'])

,ISU_CD,ISU_SRT_CD,ISU_NM,ISU_ABBRV,ISU_ENG_NM,LIST_DD,MKT_TP_NM,SECUGRP_NM,SECT_TP_NM,KIND_STKCERT_TP_NM,PARVAL,LIST_SHRS
0,KR7095570008,095570,AJ네트웍스보통주,AJ네트웍스,"AJ Networks Co.,Ltd.",2015/08/21,KOSPI,주권,,보통주,"1,000","46,822,295"
1,KR7006840003,006840,AK홀딩스보통주,AK홀딩스,"AK Holdings, Inc.",1999/08/11,KOSPI,주권,,보통주,"5,000","13,247,561"
2,KR7282330000,282330,BGF리테일보통주,BGF리테일,BGF Retail,2017/12/08,KOSPI,주권,,보통주,"1,000","17,283,906"
3,KR7027410000,027410,BGF보통주,BGF,BGF,2014/05/19,KOSPI,주권,,보통주,"1,000","95,716,791"
4,KR7138930003,138930,BNK금융지주보통주,BNK금융지주,BNK Financial Group Inc.,2011/03/30,KOSPI,주권,,보통주,"5,000","325,935,246"
...,...,...,...,...,...,...,...,...,...,...,...,...
934,KR7069260008,069260,휴켐스보통주,휴켐스,HuchemsFineChemicalCorporation,2002/10/07,KOSPI,주권,,보통주,"1,000","40,878,588"
935,KR7000541003,000545,흥국화재해상보험1우선주,흥국화재우,HeungkukFire&MarineIns(1P),1990/03/20,KOSPI,주권,,구형우선주,"5,000","768,000"
936,KR7000542001,000547,흥국화재해상보험2우선주(신형),흥국화재2우B,HeungkukFire&MarineIns(2PB),1999/08/09,KOSPI,주권,,신형우선주,"5,000","153,600"
937,KR7000540005,000540,흥국화재해상보험보통주,흥국화재,HeungkukFire&MarineInsurance,1974/12/05,KOSPI,주권,,보통주,"5,000","64,242,645"
938,KR7003280005,003280,흥아해운보통주,흥아해운,HeungaShipping,1976/06/29,KOSPI,주권,,보통주,500,"239,751,486"

In [17]:
url = 'https://finance.naver.com/item/coinfo.naver?'
parm = {'code': '005930'}

r = requests.get(url, params=parm)
html = r.text

In [25]:
code = '005930'
url = 'https://finance.naver.com/item/coinfo.naver?' + 'code=005930'

# read_html : requests의 r을 r.text로 가져와도 되고 , url 자체를 가져오고 인코딩해도됨
df_list = pd.read_html(url, encoding='euc-kr')
# df_list[3].dropna().head(5)
df_list[4]

                   0                  1
0   PERlEPS(2021.06)  14.78배  l  4,749원
1          추정PERlEPS  12.00배  l  5,737원
2  PBRlBPS (2021.06)     ∞배  l  40,361원
3      배당수익률l2020.12              4.26%

In [55]:
from bs4 import BeautifulSoup

url = 'https://finance.naver.com/item/coinfo.naver?'
parm = {'code': '005930'}

r = requests.get(url, params=parm)
html = r.text

soup = BeautifulSoup(html, 'html.parser')
table = soup.select('table.lwidth')[0]  # tag : table / class : lwidth  
table
pd.read_html(str(table))[0]

             0           1
0  외국인한도주식수(A)  5969782550
1  외국인보유주식수(B)  3069826224
2  외국인소진율(B/A)      51.42%

In [1]:
from pathlib import Path

In [8]:
path1 = Path.home() / 'Desktop'
# 위와 동일한 결과
path2 = Path.home().joinpath('Desktop')
print(path1, path2, sep='\n')

C:\Users\user\Desktop
C:\Users\user\Desktop

In [9]:
Path.cwd()

WindowsPath('c:/Users/user/PycharmProjects/PythonGuide')

In [15]:
path = Path('.')
path.absolute()

WindowsPath('c:/Users/user/PycharmProjects/PythonGuide')

In [21]:
# 바탕화면 경로
path1 = Path.home().joinpath('Desktop', 'README.md')
# 위와 동일한 결과
path2 = Path.home() / 'Desktop' / 'README.md'
print(path1, path2, sep='\n')

C:\Users\user\Desktop\README.md
C:\Users\user\Desktop\README.md

In [32]:
path = Path.home().joinpath('Desktop', 'README.md')
# path.parent
list(path.parents)

[WindowsPath('C:/Users/user/Desktop'),
 WindowsPath('C:/Users/user'),
 WindowsPath('C:/Users'),
 WindowsPath('C:/')]

In [34]:
path = Path.home().joinpath('Desktop', 'README.md')
fileName = path.name
fileSuffix = path.suffix
print(fileName, fileSuffix, sep='\n')

README.md
.md

In [37]:
path = Path.home().joinpath('Desktop')
os.path.exists(path)

True

In [3]:
import numpy as np
import pandas as pd
from pandas import DataFrame

df = DataFrame({'group_1': ['a', 'a', 'a', 'a', 'b'], 
                       'group_2': ['c', 'c', 'd', 'd','e'], 
                       'col': [1, np.NaN, 4, 5, 6]})

df['count_col'] = df.groupby(['group_1', 'group_2']).col.transform('count')
df

  group_1 group_2  col  count_col
0       a       c  1.0          1
1       a       c  NaN          1
2       a       d  4.0          2
3       a       d  5.0          2
4       b       e  6.0          1

In [45]:
df['sum_col'] = df.groupby(['group_1', 'group_2']).col.transform('sum')
df

  group_1 group_2  col  count_col  SUM_col  sum_col
0       a       c  1.0        1.0      1.0      1.0
1       a       c  NaN        1.0      1.0      1.0
2       a       d  4.0        9.0      9.0      9.0
3       a       d  5.0        9.0      9.0      9.0
4       b       e  6.0        6.0      6.0      6.0

In [46]:
df['max_col'] = df.groupby(['group_1', 'group_2']).col.transform('max')
df

  group_1 group_2  col  count_col  SUM_col  sum_col  max_col
0       a       c  1.0        1.0      1.0      1.0      1.0
1       a       c  NaN        1.0      1.0      1.0      1.0
2       a       d  4.0        9.0      9.0      9.0      5.0
3       a       d  5.0        9.0      9.0      9.0      5.0
4       b       e  6.0        6.0      6.0      6.0      6.0

In [10]:
df = pd.DataFrame({'country' : ['kor']*3 + ['jap']*3,
                    'value' : [100,105,109,100,101,100]})
df['pct_change']=df.groupby(['country']).value.pct_change()
df['cumulativeReturn']=df.groupby(['country'])['pct_change'].transform(lambda x : x+1)
df['cumulativeReturn']=df.groupby(['country'])['cumulativeReturn'].cumprod()
df

  country  value  pct_change  cumulativeReturn
0     kor    100         NaN               NaN
1     kor    105    0.050000              1.05
2     kor    109    0.038095              1.09
3     jap    100         NaN               NaN
4     jap    101    0.010000              1.01
5     jap    100   -0.009901              1.00

In [11]:
df = pd.DataFrame({'country' : ['kor']*3 + ['jap']*3,
                    'value' : [100,105,109,100,101,100]})
df['pct_change']=df.groupby(['country']).value.pct_change()
df['cumulativeReturn']=df.groupby(['country'])['pct_change'].transform(lambda x : x+1).cumprod()
df

  country  value  pct_change  cumulativeReturn
0     kor    100         NaN               NaN
1     kor    105    0.050000            1.0500
2     kor    109    0.038095            1.0900
3     jap    100         NaN               NaN
4     jap    101    0.010000            1.1009
5     jap    100   -0.009901            1.0900

In [4]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame({'col1' : np.arange(10),
                    'col2' : np.arange(10)})
df.iloc[:2]

   col1  col2
0     0     0
1     1     1

In [21]:
data = {
    'col1' : np.random.randint(0,10,size=(5)),
    'col2' : np.random.randint(0,10,size=(5))
}

df = pd.DataFrame(data)
df

   col1  col2
0     1     1
1     5     2
2     7     3
3     6     6
4     3     9

In [28]:
df.iloc[2:3]

   col1  col2
2     7     3

In [26]:
df.loc[2:3]

   col1  col2
2     7     3
3     6     6

In [45]:
dic = {
    'col1': [1, 2, 3, 4, 5, 6],
    'col2': ['apple', 'abcde', 'lelele', 'Ppa', 'xyzab', '123']
}

df = pd.DataFrame(dic)
df

   col1    col2
0     1   apple
1     2   abcde
2     3  lelele
3     4     Ppa
4     5   xyzab
5     6     123

In [47]:
con = df.col2.str.contains('pp', case=False, regex=False)
df.loc[con]

   col1   col2
0     1  apple
3     4    Ppa

In [48]:
con = df.col2.str.contains('a+', case=False, regex=True)
df.loc[con]

   col1   col2
0     1  apple
1     2  abcde
3     4    Ppa
4     5  xyzab

In [71]:
df.col2.str.extract(r"(a+)")

     0
0    a
1    a
2  NaN
3    a
4    a
5  NaN

In [59]:
df

   col1    col2
0     1   apple
1     2   abcde
2     3  lelele
3     4     Ppa
4     5   xyzab
5     6     123

In [7]:
s = pd.Series(["ab c", "c de ", np.nan, " f g h "], dtype="string")
s

0       ab c
1      c de
2       <NA>
3     f g h
dtype: string

In [8]:
s.str.replace(' ','')

0     abc
1     cde
2    <NA>
3     fgh
dtype: string

In [9]:
s.str.strip()

0     ab c
1     c de
2     <NA>
3    f g h
dtype: string